In [1]:
from src import SQL_Executor, SQL_Queries

executor = SQL_Executor()
query = SQL_Queries.Portfolio()

New customers: Count of users who registered in that month

In [2]:
executor.execute_query(query.new_customers())

      month  user_count
0   2023-12         982
1   2024-01         441
2   2024-02         442
3   2024-03         634
4   2024-04         637
5   2024-05         639
6   2024-06         641
7   2024-07         644
8   2024-08         904
9   2024-09         908
10  2024-10         650
11  2024-11        1175

In [3]:
executor.execute_query(query.active_customers())

      month  user_count
0   2023-12         838
1   2024-01         379
2   2024-02         381
3   2024-03         531
4   2024-04         533
5   2024-05         539
6   2024-06         545
7   2024-07         536
8   2024-08         773
9   2024-09         749
10  2024-10         564
11  2024-11         999

In [5]:
executor.execute_query(query.transaction_volume())

      month  transaction_count  transaction_amount
0   2023-12                817           390514.66
1   2024-01                665           245103.96
2   2024-02                605           194921.17
3   2024-03               1597           688981.42
4   2024-04               1591           785213.08
5   2024-05               1488           607347.83
6   2024-06               1174           418896.70
7   2024-07               1348           643379.65
8   2024-08               2595          1142019.75
9   2024-09               2879          1392094.44
10  2024-10               2180           956599.28
11  2024-11               6003          2372425.70
12  2024-12                  5             5467.21

In [4]:
executor.execute_query(query.installment_plans())

      month  installments_count  transaction_count  transaction_amount
0   2023-12                   4                589           188364.70
1   2023-12                   6                176           117729.12
2   2023-12                  12                 46            67488.63
3   2023-12                  24                  6            16932.21
4   2024-01                   4                542           143212.03
5   2024-01                   6                 97            57438.69
6   2024-01                  12                 22            33156.85
7   2024-01                  24                  4            11296.39
8   2024-02                   4                507           134407.92
9   2024-02                   6                 86            44671.96
10  2024-02                  12                 11            12593.78
11  2024-02                  24                  1             3247.51
12  2024-03                   4               1203           356349.95
13  2024-03                   6                307           185406.24
14  2024-03                  12                 75           115183.25
15  2024-03                  24                 12            32041.98
16  2024-04                   4               1165           390531.13
17  2024-04                   6                329           218998.80
18  2024-04                  12                 84           136469.00
19  2024-04                  24                 13            39214.15
20  2024-05                   4               1162           333432.57
21  2024-05                   6                257           160074.18
22  2024-05                  12                 60            91694.25
23  2024-05                  24                  9            22146.83
24  2024-06                   4                943           245042.02
25  2024-06                   6                196           113817.66
26  2024-06                  12                 28            35512.09
27  2024-06                  24                  7            24524.93
28  2024-07                   4                973           305125.51
29  2024-07                   6                282           169815.52
30  2024-07                  12                 78           123443.24
31  2024-07                  24                 15            44995.38
32  2024-08                   4               1937           566206.42
33  2024-08                   6                535           355305.30
34  2024-08                  12                101           159475.39
35  2024-08                  24                 22            61032.64
36  2024-09                   4               2120           682308.72
37  2024-09                   6                587           386745.56
38  2024-09                  12                147           251341.72
39  2024-09                  24                 25            71698.44
40  2024-10                   4               1605           477331.63
41  2024-10                   6                478           307733.72
42  2024-10                  12                 85           137615.97
43  2024-10                  24                 12            33917.96
44  2024-11                   4               4652          1284415.83
45  2024-11                   6               1114           675235.30
46  2024-11                  12                207           322237.16
47  2024-11                  24                 30            90537.41
48  2024-12                   6                  1             1136.04
49  2024-12                  12                  4             4331.17

In [6]:
executor.execute_query(query.popular_categories())

      category  transaction_count
0  electronics              11755
1      fashion               9486
2         home               9136
3       sports               6205
4       beauty               5774
5       others               2267